----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_1a_replication.log
  log type:  text
 opened on:  20 Dec 2024, 21:44:37

. 
. xttobit prop_emnes gni_per_capita perc_roads_paved total_phones_per_1000 geographic_proximity colonial_link, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -42.719387  
Iteration 1:  Log likelihood = -24.405568  
Iteration 2:  Log likelihood = -22.758864  
Iteration 3:  Log likelihood = -22.742176  
Iteration 4:  Log likelihood = -22.742171  
Iteration 5:  Log likelihood = -22.742171  

Fitting full model:

Iteration 0:  Log likelihood =  -23.60378  
Iteration 1:  Log likelihood = -4.0801766  
Iteration 2:  Log likelihood = -3.0862112  
Iteration 3:  Log likelihood = -3.0842473  
Iteration 4:  Log likelihood = -3.0842472  

Obtaining starting values for full model:

Iteration 0:  Log likelihood =  86.029741
Iteration 1:  Log likelihood =  87.772608
Iteration 2:  Log likelihood =  90.339845
Iteration 3:  Log likelihood =  90.604083
Iteration 4:  Log likelihood =  90.613746
Iteration 5:  Log likelihood =  90.613767

Fitting full model:

Iteration 0:  Log likelihood = -5.9602874  
Iteration 1:  Log likelihood =  13.059399  
Iteration 2:  Log likelihood =  14.664148  
Iteration 3:  Log likelihood =  14.721384  
Iteration 4:  Log likelihood =  14.721384  (backed up)
Iteration 5:  Log likelihood =  14.852907  
Iteration 6:  Log likelihood =  14.858271  
Iteration 7:  Log likelihood =  14.858294  
Iteration 8:  Log likelihood =  14.858294  

Random-effects tobit regression                     Number of obs     =     64
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     38
        Upper = 100                                    Right-censored =      0

Group variable: country_id                          Number of groups  =     32
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(5)      =  71.81
Log likelihood = 14.858294                          Prob > chi2       = 0.0000

---------------------------------------------------------------------------------------
           prop_emnes | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
       gni_per_capita |   .0002912   .0002294     1.27   0.204    -.0001585    .0007409
     perc_roads_paved |   .0065447   .0030066     2.18   0.029     .0006518    .0124376
total_phones_per_1000 |  -.0021583   .0012459    -1.73   0.083    -.0046001    .0002836
 geographic_proximity |   .5550511   .0704528     7.88   0.000     .4169661     .693136
        colonial_link |   .2461955   .0717137     3.43   0.001     .1056392    .3867518
                _cons |  -.4668033   .1005436    -4.64   0.000    -.6638651   -.2697415
----------------------+----------------------------------------------------------------
             /sigma_u |   .1855904   .0359565     5.16   0.000     .1151169    .2560639
             /sigma_e |   .0340127   .0065383     5.20   0.000     .0211978    .0468276
----------------------+----------------------------------------------------------------
                  rho |   .9675045   .0174426                      .9154363    .9897107
---------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 35.89              Prob >= chibar2 = 0.000


. 
. * Store the results of the random effects model

. estimates store re_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_1a_replication.log
  log type:  text
 closed on:  20 Dec 2024, 21:44:37
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_1a_replication.log
  log type:  text
 opened on:  20 Dec 2024, 21:44:37

. 
. tobit prop_emnes gni_per_capita perc_roads_paved total_phones_per_1000 geographic_proximity colonial_link, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -25.822342

Fitting full model:

Iteration 0:  Log likelihood = -25.822342  
Iteration 1:  Log likelihood = -7.9922376  
Iteration 2:  Log likelihood = -3.1831881  
Iteration 3:  Log likelihood = -3.0852767  
Iteration 4:  Log likelihood = -3.0842475  
Iteration 5:  Log likelihood = -3.0842472  

Tobit regression                                    Number of obs     =     64
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     38
        Upper = 100                                    Right-censored =      0

                                                    LR chi2(5)        =  39.32
                                                    Prob > chi2       = 0.0000
Log likelihood = -3.0842472                         Pseudo R2         = 0.8644

---------------------------------------------------------------------------------------
           prop_emnes | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
       gni_per_capita |   .0002795   .0001673     1.67   0.100    -.0000552    .0006142
     perc_roads_paved |   .0030132   .0025452     1.18   0.241    -.0020797    .0081061
total_phones_per_1000 |  -.0014605   .0010363    -1.41   0.164    -.0035341     .000613
 geographic_proximity |   .3974115    .065394     6.08   0.000     .2665585    .5282645
        colonial_link |   .1366749   .0654662     2.09   0.041     .0056774    .2676725
                _cons |  -.2538395    .084578    -3.00   0.004    -.4230798   -.0845993
----------------------+----------------------------------------------------------------
     var(e.prop_emnes)|   .0189488   .0058482                      .0102182     .035139
---------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison

. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_1a_replication.log
  log type:  text
 closed on:  20 Dec 2024, 21:44:37
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_1a_replication.log
  log type:  text
 opened on:  20 Dec 2024, 21:44:37

. 
. summarize prop_emnes gni_per_capita perc_roads_paved total_phones_per_1000 geographic_proximity colonial_link

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  prop_emnes |         64    .0725821    .1202001          0         .5
gni_per_ca~a |         64    290.3125    136.2883        100        710
perc_roads~d |         64    16.21563    10.65616         .8       44.5
total_p~1000 |         64    26.65625    25.63803          3        104
geographic~y |         64     .109375    .3145764          0          1
-------------+---------------------------------------------------------
colonial_l~k |         64         .75    .4364358          0          1

. 
. pwcorr prop_emnes gni_per_capita perc_roads_paved total_phones_per_1000 geographic_proximity colonial_link, star(0.05)

             | prop~nes gni_pe~a perc_r~d tot~1000 geogra~y coloni~k
-------------+------------------------------------------------------
  prop_emnes |   1.0000 
gni_per_ca~a |   0.0774   1.0000 
perc_roads~d |  -0.1347   0.2465*  1.0000 
total_p~1000 |   0.0718   0.3507*  0.4162*  1.0000 
geographic~y |   0.7650* -0.1082  -0.2037   0.0776   1.0000 
colonial_l~k |   0.3084*  0.2255  -0.2094   0.1908   0.2023   1.0000 

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_1a_replication.log
  log type:  text
 closed on:  20 Dec 2024, 21:44:37
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
