----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3b_replication.log
  log type:  text
 opened on:  11 Jun 2024, 19:54:46

. 
. xttobit prop_emnes_excl_former_col_power c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_capit
> a perc_roads_paved total_phones_per_1000 geographic_proximity colonial_link, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -47.104778  
Iteration 1:  Log likelihood = -35.551402  
Iteration 2:  Log likelihood = -34.914405  
Iteration 3:  Log likelihood =  -34.91409  
Iteration 4:  Log likelihood =  -34.91409  

Fitting full model:

Iteration 0:  Log likelihood = -32.482762  
Iteration 1:  Log likelihood = -20.455622  
Iteration 2:  Log likelihood = -19.932213  
Iteration 3:  Log likelihood = -19.931357  
Iteration 4:  Log likelihood = -19.931357  

Obtaining starting values for full model:

Iteration 0:  Log likelihood =   16.24946
Iteration 1:  Log likelihood =  16.555818
Iteration 2:  Log likelihood =  16.557541
Iteration 3:  Log likelihood =  16.557542

Fitting full model:

Iteration 0:  Log likelihood =  -21.03975  (not concave)
Iteration 1:  Log likelihood = -17.158486  (not concave)
Iteration 2:  Log likelihood =  -15.44519  
Iteration 3:  Log likelihood =  -3.838359  (not concave)
Iteration 4:  Log likelihood = -3.7861887  (not concave)
Iteration 5:  Log likelihood = -3.7232119  (not concave)
Iteration 6:  Log likelihood = -.89065978  (not concave)
Iteration 7:  Log likelihood = -.00323678  (not concave)
Iteration 8:  Log likelihood = -.00323678  (not concave)
Iteration 9:  Log likelihood =  .21008824  
Iteration 10: Log likelihood =   .4357777  
Iteration 11: Log likelihood =  .46311185  
Iteration 12: Log likelihood =  .46325531  
Iteration 13: Log likelihood =  .46325532  

Random-effects tobit regression                     Number of obs     =     54
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     28
        Upper = 100                                    Right-censored =      0

Group variable: country_id                          Number of groups  =     28
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      1
                                                                  avg =    1.9
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(11)     =  25.21
Log likelihood = .46325532                          Prob > chi2       = 0.0085

--------------------------------------------------------------------------------------------------
prop_emnes_excl_former_col_power | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------------+----------------------------------------------------------------
                c1_voice_and_acc |   -.091104   .0716464    -1.27   0.204    -.2315284    .0493204
                c2_pol_stability |  -.0669081   .0562832    -1.19   0.235    -.1772211     .043405
            c3_gov_effectiveness |   .0531761   .0552297     0.96   0.336    -.0550722    .1614244
                  c4_reg_quality |   .1237071   .0808379     1.53   0.126    -.0347323    .2821464
                  c5_rule_of_law |   .1698641   .1179239     1.44   0.150    -.0612624    .4009907
        c6_control_of_corruption |  -.1118673   .0887619    -1.26   0.208    -.2858374    .0621028
                  gni_per_capita |  -.0000468   .0004107    -0.11   0.909    -.0008516    .0007581
                perc_roads_paved |   .0017339   .0067557     0.26   0.797    -.0115071     .014975
           total_phones_per_1000 |  -.0020642   .0024575    -0.84   0.401    -.0068808    .0027524
            geographic_proximity |   .5140229   .2027505     2.54   0.011     .1166392    .9114065
                   colonial_link |   .3471564   .1475992     2.35   0.019     .0578672    .6364456
                           _cons |  -.3070259   .2119318    -1.45   0.147    -.7224047    .1083529
---------------------------------+----------------------------------------------------------------
                        /sigma_u |   .3590841   .0660099     5.44   0.000     .2297071    .4884611
                        /sigma_e |   .0558567   .0111489     5.01   0.000     .0340053    .0777081
---------------------------------+----------------------------------------------------------------
                             rho |   .9763748   .0126339                      .9381907    .9924159
--------------------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 40.79              Prob >= chibar2 = 0.000


. 
. * Store the results of the random effects model

. estimates store re_model

. 
. * Export random effects model results to Excel

. mat b = e(b)

. mat V = e(V)

. 
. putexcel set "../results/random_effects_model_3b.xlsx", replace
note: file will be replaced when the first putexcel command is issued.

. putexcel A1 = matrix(b), names
file ../results/random_effects_model_3b.xlsx saved

. putexcel set "../results/random_effects_model_3b.xlsx", modify

. putexcel A1 = matrix(V)
file ../results/random_effects_model_3b.xlsx saved

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3b_replication.log
  log type:  text
 closed on:  11 Jun 2024, 19:54:46
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3b_replication.log
  log type:  text
 opened on:  11 Jun 2024, 19:54:46

. 
. tobit prop_emnes_excl_former_col_power c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_capita 
> perc_roads_paved total_phones_per_1000 geographic_proximity colonial_link, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -35.883162

Fitting full model:

Iteration 0:  Log likelihood = -35.883162  
Iteration 1:  Log likelihood = -22.466467  
Iteration 2:  Log likelihood = -20.021561  
Iteration 3:  Log likelihood = -19.932427  
Iteration 4:  Log likelihood = -19.931358  
Iteration 5:  Log likelihood = -19.931357  

Tobit regression                                    Number of obs     =     54
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     28
        Upper = 100                                    Right-censored =      0

                                                    LR chi2(11)       =  29.97
                                                    Prob > chi2       = 0.0016
Log likelihood = -19.931357                         Pseudo R2         = 0.4291

---------------------------------------------------------------------------------------------------------
       prop_emnes_excl_former_col_power | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------------------------+----------------------------------------------------------------
                       c1_voice_and_acc |  -.1130637   .1359193    -0.83   0.410    -.3871712    .1610437
                       c2_pol_stability |  -.1141535   .1088166    -1.05   0.300     -.333603    .1052961
                   c3_gov_effectiveness |   .2626377   .1796717     1.46   0.151    -.0997048    .6249801
                         c4_reg_quality |   .0292776   .1871693     0.16   0.876    -.3481853    .4067405
                         c5_rule_of_law |   .1781921    .280299     0.64   0.528    -.3870847     .743469
               c6_control_of_corruption |  -.0503606   .2506888    -0.20   0.842    -.5559228    .4552015
                         gni_per_capita |  -.0000993   .0004667    -0.21   0.833    -.0010405    .0008419
                       perc_roads_paved |   .0022939   .0074129     0.31   0.758    -.0126557    .0172435
                  total_phones_per_1000 |  -.0039575   .0032067    -1.23   0.224    -.0104244    .0025094
                   geographic_proximity |   .3200739   .1764193     1.81   0.077    -.0357096    .6758574
                          colonial_link |   .5471078   .1984491     2.76   0.009     .1468971    .9473185
                                  _cons |   -.255901    .232675    -1.10   0.278    -.7251349    .2133329
----------------------------------------+----------------------------------------------------------------
 var(e.prop_emnes_excl_former_col_power)|   .1070867   .0317201                      .0589256    .1946107
---------------------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison

. estimates store pooled_model

. 
. * Export pooled Tobit model results to Excel

. mat b = e(b)

. mat V = e(V)

. 
. putexcel set "../results/pooled_tobit_model_3b.xlsx", replace
note: file will be replaced when the first putexcel command is issued.

. putexcel A1 = matrix(b), names
file ../results/pooled_tobit_model_3b.xlsx saved

. putexcel set "../results/pooled_tobit_model_3b.xlsx", modify

. putexcel A1 = matrix(V)
file ../results/pooled_tobit_model_3b.xlsx saved

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3b_replication.log
  log type:  text
 closed on:  11 Jun 2024, 19:54:47
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3b_replication.log
  log type:  text
 opened on:  11 Jun 2024, 19:54:47

. 
. * Summary statistics

. summarize prop_emnes_excl_former_col_power c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_cap
> ita perc_roads_paved total_phones_per_1000 geographic_proximity colonial_link

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
prop_emnes~r |         54    .1642776    .2601345          0          1
c1_voice_a~c |         64   -.6409375    .6038178      -1.75        .61
c2_pol_sta~y |         64   -.6548437    .8392154      -2.38       1.07
c3_gov_eff~s |         64   -.6017188    .5321641      -1.75        .25
c4_reg_qua~y |         64   -.4598437    .5850614      -2.35        .43
-------------+---------------------------------------------------------
c5_rule_of~w |         64   -.7315625    .3840851      -1.79       -.08
c6_control~n |         64   -.6585937    .3406337      -1.43        .17
gni_per_ca~a |         64    290.3125    136.2883        100        710
perc_roads~d |         64    16.21563    10.65616         .8       44.5
total_p~1000 |         64    26.65625    25.63803          3        104
-------------+---------------------------------------------------------
geographic~y |         64     .109375    .3145764          0          1
colonial_l~k |         64         .75    .4364358          0          1

. 
. * Export summary statistics to Excel

. export excel using "../results/summary_statistics_3b.xlsx", sheet("Summary Statistics") firstrow(variables) replace
file ../results/summary_statistics_3b.xlsx saved

. 
. * Correlation matrix

. pwcorr prop_emnes_excl_former_col_power c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_capita
>  perc_roads_paved total_phones_per_1000 geographic_proximity colonial_link, star(0.05)

             | prop_e~r c1_voi~c c2_pol~y c3_gov~s c4_reg~y c5_rul~w c6_con~n
-------------+---------------------------------------------------------------
prop_emnes~r |   1.0000 
c1_voice_a~c |   0.0527   1.0000 
c2_pol_sta~y |   0.0144   0.5744*  1.0000 
c3_gov_eff~s |   0.2843*  0.4154*  0.4908*  1.0000 
c4_reg_qua~y |   0.2847*  0.5897*  0.4863*  0.6565*  1.0000 
c5_rule_of~w |   0.1782   0.4604*  0.5572*  0.6684*  0.7682*  1.0000 
c6_control~n |  -0.0651   0.2762*  0.4504*  0.5725*  0.4315*  0.5580*  1.0000 
gni_per_ca~a |  -0.0428   0.0596  -0.0795   0.0290   0.0582   0.0039  -0.0011 
perc_roads~d |  -0.1630  -0.0985   0.2149   0.0605   0.0142   0.1043   0.1779 
total_p~1000 |   0.0673  -0.0090   0.2724*  0.3628*  0.1985   0.3922*  0.3316*
geographic~y |   0.4666*  0.1117   0.0664   0.2353   0.3000*  0.2156  -0.1140 
colonial_l~k |   0.3913*  0.1924   0.0981   0.1833   0.2264   0.1378  -0.0627 

             | gni_pe~a perc_r~d tot~1000 geogra~y coloni~k
-------------+---------------------------------------------
gni_per_ca~a |   1.0000 
perc_roads~d |   0.2465*  1.0000 
total_p~1000 |   0.3507*  0.4162*  1.0000 
geographic~y |  -0.1082  -0.2037   0.0776   1.0000 
colonial_l~k |   0.2255  -0.2094   0.1908   0.2023   1.0000 

. 
. * Export correlation matrix to Excel

. matrix R = r(C)

. 
. putexcel set "../results/correlation_matrix_3b.xlsx", replace
note: file will be replaced when the first putexcel command is issued.

. putexcel A1 = matrix(R), names
file ../results/correlation_matrix_3b.xlsx saved

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3b_replication.log
  log type:  text
 closed on:  11 Jun 2024, 19:54:47
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
