-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_2a_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:40:08

. 
. xttobit prop_emnes_excl_nat_res gni_per_capita perc_roads_paved total_phones_per_1000 geograp
> hic_proximity colonial_link, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -162.76681  
Iteration 1:  Log likelihood = -144.48729  
Iteration 2:  Log likelihood = -142.89796  
Iteration 3:  Log likelihood = -142.88346  
Iteration 4:  Log likelihood = -142.88346  

Fitting full model:

Iteration 0:  Log likelihood = -144.63487  
Iteration 1:  Log likelihood = -125.14493  
Iteration 2:  Log likelihood = -124.16547  
Iteration 3:  Log likelihood = -124.16366  
Iteration 4:  Log likelihood = -124.16366  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -212.01114
Iteration 1:  Log likelihood = -211.83268
Iteration 2:  Log likelihood = -208.05109
Iteration 3:  Log likelihood = -207.43247
Iteration 4:  Log likelihood = -207.38737
Iteration 5:  Log likelihood = -207.38697

Fitting full model:

Iteration 0:  Log likelihood = -126.95344  
Iteration 1:  Log likelihood = -108.33947  
Iteration 2:  Log likelihood = -106.78595  
Iteration 3:  Log likelihood =  -106.7223  
Iteration 4:  Log likelihood =  -106.7223  (backed up)
Iteration 5:  Log likelihood = -106.63505  
Iteration 6:  Log likelihood = -106.63048  
Iteration 7:  Log likelihood = -106.63046  
Iteration 8:  Log likelihood = -106.63046  

Random-effects tobit regression                     Number of obs     =     64
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     38
        Upper = 100                                    Right-censored =      0

Group variable: country_id                          Number of groups  =     32
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(5)      =  62.84
Log likelihood = -106.63046                         Prob > chi2       = 0.0000

-----------------------------------------------------------------------------------------
prop_emnes_excl_nat_res | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
------------------------+----------------------------------------------------------------
         gni_per_capita |   .0241936   .0237507     1.02   0.308    -.0223569     .070744
       perc_roads_paved |    .689378   .3268162     2.11   0.035     .0488299    1.329926
  total_phones_per_1000 |  -.2076384     .13452    -1.54   0.123    -.4712928    .0560161
   geographic_proximity |   55.68002   7.457048     7.47   0.000     41.06447    70.29557
          colonial_link |   25.03081   8.007355     3.13   0.002     9.336687    40.72494
                  _cons |  -46.36295   11.19601    -4.14   0.000    -68.30672   -24.41918
------------------------+----------------------------------------------------------------
               /sigma_u |   18.84097   3.720916     5.06   0.000     11.54811    26.13383
               /sigma_e |   3.778308   .7254381     5.21   0.000     2.356476    5.200141
------------------------+----------------------------------------------------------------
                    rho |   .9613397   .0208584                      .8994995     .987908
-----------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 35.07              Prob >= chibar2 = 0.000


. 
. * Store the results of the random effects model
. estimates store re_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_2a_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:40:09
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_2a_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:40:09

. 
. tobit prop_emnes_excl_nat_res gni_per_capita perc_roads_paved total_phones_per_1000 geographi
> c_proximity colonial_link, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -146.84337

Fitting full model:

Iteration 0:  Log likelihood = -146.84337  
Iteration 1:  Log likelihood = -129.01533  
Iteration 2:  Log likelihood = -124.25824  
Iteration 3:  Log likelihood = -124.16457  
Iteration 4:  Log likelihood = -124.16366  
Iteration 5:  Log likelihood = -124.16366  

Tobit regression                                    Number of obs     =     64
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     38
        Upper = 100                                    Right-censored =      0

                                                    LR chi2(5)        =  37.44
                                                    Prob > chi2       = 0.0000
Log likelihood = -124.16366                         Pseudo R2         = 0.1310

----------------------------------------------------------------------------------------------
     prop_emnes_excl_nat_res | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
              gni_per_capita |   .0208505   .0176996     1.18   0.244    -.0145663    .0562674
            perc_roads_paved |   .3618579   .2706606     1.34   0.186    -.1797328    .9034485
       total_phones_per_1000 |    -.14505   .1093402    -1.33   0.190    -.3638393    .0737392
        geographic_proximity |   40.35258   6.914056     5.84   0.000     26.51759    54.18758
               colonial_link |   15.23561   7.006862     2.17   0.034     1.214916    29.25631
                       _cons |  -26.14617   8.987742    -2.91   0.005     -44.1306   -8.161741
-----------------------------+----------------------------------------------------------------
var(e.prop_emnes_excl_nat_~s)|   212.5255   65.38181                      114.8321    393.3314
----------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison
. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_2a_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:40:09
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_2a_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:40:09

. 
. summarize prop_emnes_excl_nat_res gni_per_capita perc_roads_paved total_phones_per_1000 geogr
> aphic_proximity colonial_link

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
prop_emnes~s |         64    7.264092    12.32506          0         50
gni_per_ca~a |         64    290.3125    136.2883        100        710
perc_roads~d |         64    16.21563    10.65616         .8       44.5
total_p~1000 |         64    26.65625    25.63803          3        104
geographic~y |         64     .109375    .3145764          0          1
-------------+---------------------------------------------------------
colonial_l~k |         64         .75    .4364358          0          1

. 
. pwcorr prop_emnes_excl_nat_res gni_per_capita perc_roads_paved total_phones_per_1000 geograph
> ic_proximity colonial_link, star(0.05)

             | prop~res gni_pe~a perc_r~d tot~1000 geogra~y coloni~k
-------------+------------------------------------------------------
prop_emnes~s |   1.0000 
gni_per_ca~a |   0.0242   1.0000 
perc_roads~d |  -0.1180   0.2465*  1.0000 
total_p~1000 |   0.0766   0.3507*  0.4162*  1.0000 
geographic~y |   0.7543* -0.1082  -0.2037   0.0776   1.0000 
colonial_l~k |   0.3010*  0.2255  -0.2094   0.1908   0.2023   1.0000 

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_2a_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:40:09
-----------------------------------------------------------------------------------------------
