-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_3a_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:40:23

. 
. xttobit prop_emnes_excl_former_col_power gni_per_capita perc_roads_paved total_phones_per_100
> 0 geographic_proximity, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -160.80569  
Iteration 1:  Log likelihood = -147.28782  
Iteration 2:  Log likelihood = -145.82096  
Iteration 3:  Log likelihood = -145.80894  
Iteration 4:  Log likelihood = -145.80894  

Fitting full model:

Iteration 0:  Log likelihood = -154.25314  
Iteration 1:  Log likelihood = -141.06644  
Iteration 2:  Log likelihood = -140.15124  
Iteration 3:  Log likelihood = -140.14837  
Iteration 4:  Log likelihood = -140.14837  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -227.73034
Iteration 1:  Log likelihood = -227.53838
Iteration 2:  Log likelihood = -227.53721
Iteration 3:  Log likelihood = -227.53721

Fitting full model:

Iteration 0:  Log likelihood = -132.65764  
Iteration 1:  Log likelihood = -125.58303  
Iteration 2:  Log likelihood = -123.06943  (not concave)
Iteration 3:  Log likelihood = -121.65189  (not concave)
Iteration 4:  Log likelihood = -120.98116  (not concave)
Iteration 5:  Log likelihood = -120.67442  (not concave)
Iteration 6:  Log likelihood = -120.45646  (not concave)
Iteration 7:  Log likelihood = -120.41227  (not concave)
Iteration 8:  Log likelihood = -120.36518  (not concave)
Iteration 9:  Log likelihood = -120.29705  (not concave)
Iteration 10: Log likelihood = -120.15743  (not concave)
Iteration 11: Log likelihood =  -120.1271  (not concave)
Iteration 12: Log likelihood =  -120.1271  (not concave)
Iteration 13: Log likelihood = -120.09834  (not concave)
Iteration 14: Log likelihood = -119.75637  (not concave)
Iteration 15: Log likelihood = -119.71688  
Iteration 16: Log likelihood = -119.64729  
Iteration 17: Log likelihood = -119.52381  
Iteration 18: Log likelihood =    -119.52  
Iteration 19: Log likelihood = -119.51999  

Random-effects tobit regression                     Number of obs     =     54
                                                           Uncensored =     23
Limits: Lower =   0                                     Left-censored =     28
        Upper = 100                                    Right-censored =      3

Group variable: country_id                          Number of groups  =     28
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      1
                                                                  avg =    1.9
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(4)      =  19.19
Log likelihood = -119.51999                         Prob > chi2       = 0.0007

----------------------------------------------------------------------------------------------
prop_emnes_excl_former_col~r | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
              gni_per_capita |   .0440702   .0522317     0.84   0.399    -.0583021    .1464425
            perc_roads_paved |  -.3209563   .8846729    -0.36   0.717    -2.054883    1.412971
       total_phones_per_1000 |   .3045041   .2997804     1.02   0.310    -.2830548    .8920629
        geographic_proximity |   72.21021   24.60872     2.93   0.003     23.97799    120.4424
                       _cons |  -28.66917   19.61116    -1.46   0.144    -67.10634    9.768001
-----------------------------+----------------------------------------------------------------
                    /sigma_u |   42.79239   7.277414     5.88   0.000     28.52892    57.05586
                    /sigma_e |    8.43642   1.704412     4.95   0.000     5.095833    11.77701
-----------------------------+----------------------------------------------------------------
                         rho |   .9625869      .0185                      .9094216    .9869881
----------------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 41.26              Prob >= chibar2 = 0.000


. 
. * Store the results of the random effects model
. estimates store re_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_3a_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:40:24
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_3a_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:40:24

. 
. tobit prop_emnes_excl_former_col_power gni_per_capita perc_roads_paved total_phones_per_1000 
> geographic_proximity, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -156.19674

Fitting full model:

Iteration 0:  Log likelihood = -156.19674  
Iteration 1:  Log likelihood = -143.20393  
Iteration 2:  Log likelihood = -140.49542  
Iteration 3:  Log likelihood = -140.15265  
Iteration 4:  Log likelihood = -140.14838  
Iteration 5:  Log likelihood = -140.14837  

Tobit regression                                    Number of obs     =     54
                                                           Uncensored =     23
Limits: Lower =   0                                     Left-censored =     28
        Upper = 100                                    Right-censored =      3

                                                    LR chi2(4)        =  11.32
                                                    Prob > chi2       = 0.0232
Log likelihood = -140.14837                         Pseudo R2         = 0.0388

----------------------------------------------------------------------------------------------
prop_emnes_excl_former_col~r | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
              gni_per_capita |   .0431403   .0529315     0.82   0.419    -.0631757    .1494564
            perc_roads_paved |  -.2401687   .8267561    -0.29   0.773    -1.900757     1.42042
       total_phones_per_1000 |  -.0266111   .3483434    -0.08   0.939    -.7262795    .6730573
        geographic_proximity |   63.22793   21.56513     2.93   0.005     19.91309    106.5428
                       _cons |  -19.94899   22.98084    -0.87   0.390    -66.10737    26.20939
-----------------------------+----------------------------------------------------------------
var(e.prop_emnes_excl_form~r)|   1940.707   652.9939                      987.3092    3814.755
----------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison
. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_3a_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:40:24
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_3a_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:40:24

. 
. summarize prop_emnes_excl_former_col_power gni_per_capita perc_roads_paved total_phones_per_1
> 000 geographic_proximity 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
prop_emnes~r |         54    16.42776    26.01345          0        100
gni_per_ca~a |         64    290.3125    136.2883        100        710
perc_roads~d |         64    16.21563    10.65616         .8       44.5
total_p~1000 |         64    26.65625    25.63803          3        104
geographic~y |         64     .109375    .3145764          0          1

. 
. pwcorr prop_emnes_excl_former_col_power gni_per_capita perc_roads_paved total_phones_per_1000
>  geographic_proximity, star(0.05)

             | prop_e~r gni_pe~a perc_r~d tot~1000 geogra~y
-------------+---------------------------------------------
prop_emnes~r |   1.0000 
gni_per_ca~a |  -0.0428   1.0000 
perc_roads~d |  -0.1630   0.2465*  1.0000 
total_p~1000 |   0.0673   0.3507*  0.4162*  1.0000 
geographic~y |   0.4666* -0.1082  -0.2037   0.0776   1.0000 

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_3a_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:40:24
-----------------------------------------------------------------------------------------------
