-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3b_replication.log
  log type:  text
 opened on:  12 Jun 2024, 15:03:04

. 
. xttobit prop_emnes_excl_former_col_power c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_capita perc_roads_
> paved total_phones_per_1000 geographic_proximity, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -47.104778  
Iteration 1:  Log likelihood = -35.551402  
Iteration 2:  Log likelihood = -34.914405  
Iteration 3:  Log likelihood =  -34.91409  
Iteration 4:  Log likelihood =  -34.91409  

Fitting full model:

Iteration 0:  Log likelihood = -35.539126  
Iteration 1:  Log likelihood = -25.070787  
Iteration 2:  Log likelihood = -24.856523  
Iteration 3:  Log likelihood = -24.856235  
Iteration 4:  Log likelihood = -24.856235  

Obtaining starting values for full model:

Iteration 0:  Log likelihood =  15.466183
Iteration 1:  Log likelihood =  15.731719
Iteration 2:  Log likelihood =  15.733027
Iteration 3:  Log likelihood =  15.733027

Fitting full model:

Iteration 0:  Log likelihood =   -22.2893  (not concave)
Iteration 1:  Log likelihood = -18.245685  (not concave)
Iteration 2:  Log likelihood = -15.053631  
Iteration 3:  Log likelihood = -5.7313259  
Iteration 4:  Log likelihood = -3.5184745  
Iteration 5:  Log likelihood = -2.9894606  
Iteration 6:  Log likelihood = -2.9894606  (backed up)
Iteration 7:  Log likelihood = -2.8887217  
Iteration 8:  Log likelihood = -2.7876353  
Iteration 9:  Log likelihood = -2.7862916  
Iteration 10: Log likelihood = -2.7862909  
Iteration 11: Log likelihood = -2.7862909  

Random-effects tobit regression                     Number of obs     =     54
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     28
        Upper = 100                                    Right-censored =      0

Group variable: country_id                          Number of groups  =     28
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      1
                                                                  avg =    1.9
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(10)     =  29.41
Log likelihood = -2.7862909                         Prob > chi2       = 0.0011

--------------------------------------------------------------------------------------------------
prop_emnes_excl_former_col_power | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------------+----------------------------------------------------------------
                c1_voice_and_acc |  -.0899089   .0737129    -1.22   0.223    -.2343836    .0545657
                c2_pol_stability |  -.0900133   .0508934    -1.77   0.077    -.1897625    .0097358
            c3_gov_effectiveness |   .0697866   .0553584     1.26   0.207    -.0387138     .178287
                  c4_reg_quality |   .1610044   .0777161     2.07   0.038     .0086837     .313325
                  c5_rule_of_law |   .2155153   .1139772     1.89   0.059    -.0078758    .4389064
        c6_control_of_corruption |  -.1769363   .0822849    -2.15   0.032    -.3382116   -.0156609
                  gni_per_capita |   .0005161   .0004324     1.19   0.233    -.0003314    .0013637
                perc_roads_paved |   .0023472   .0054685     0.43   0.668    -.0083708    .0130652
           total_phones_per_1000 |  -.0016745   .0023389    -0.72   0.474    -.0062586    .0029095
            geographic_proximity |   .7061292   .2356665     3.00   0.003     .2442314    1.168027
                           _cons |  -.3495907   .1770503    -1.97   0.048    -.6966028   -.0025785
---------------------------------+----------------------------------------------------------------
                        /sigma_u |   .4321131   .0778992     5.55   0.000     .2794334    .5847928
                        /sigma_e |   .0575195   .0113752     5.06   0.000     .0352245    .0798145
---------------------------------+----------------------------------------------------------------
                             rho |   .9825896    .009185                      .9546816    .9942778
--------------------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 44.14              Prob >= chibar2 = 0.000


. 
. * Store the results of the random effects model
. estimates store re_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3b_replication.log
  log type:  text
 closed on:  12 Jun 2024, 15:03:05
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3b_replication.log
  log type:  text
 opened on:  12 Jun 2024, 15:03:05

. 
. tobit prop_emnes_excl_former_col_power c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_capita perc_roads_pa
> ved total_phones_per_1000 geographic_proximity, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -38.896504

Fitting full model:

Iteration 0:  Log likelihood = -38.896504  
Iteration 1:  Log likelihood = -27.293316  
Iteration 2:  Log likelihood = -24.894162  
Iteration 3:  Log likelihood = -24.856525  
Iteration 4:  Log likelihood = -24.856235  
Iteration 5:  Log likelihood = -24.856235  

Tobit regression                                    Number of obs     =     54
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     28
        Upper = 100                                    Right-censored =      0

                                                    LR chi2(10)       =  20.12
                                                    Prob > chi2       = 0.0282
Log likelihood = -24.856235                         Pseudo R2         = 0.2881

---------------------------------------------------------------------------------------------------------
       prop_emnes_excl_former_col_power | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------------------------+----------------------------------------------------------------
                       c1_voice_and_acc |  -.0931896   .1408438    -0.66   0.512    -.3770417    .1906625
                       c2_pol_stability |  -.0903287   .1057468    -0.85   0.398    -.3034474      .12279
                   c3_gov_effectiveness |    .317853   .1850046     1.72   0.093    -.0549992    .6907052
                         c4_reg_quality |   .1737464   .1864698     0.93   0.357    -.2020588    .5495516
                         c5_rule_of_law |     .05987   .2875908     0.21   0.836    -.5197312    .6394711
               c6_control_of_corruption |  -.2885955   .2410903    -1.20   0.238    -.7744811    .1972901
                         gni_per_capita |   .0003951   .0004835     0.82   0.418    -.0005793    .0013695
                       perc_roads_paved |   .0008076   .0071804     0.11   0.911    -.0136635    .0152787
                  total_phones_per_1000 |  -.0021999   .0031865    -0.69   0.494    -.0086219     .004222
                   geographic_proximity |   .3865342   .1891454     2.04   0.047     .0053366    .7677318
                                  _cons |  -.1527754   .2370704    -0.64   0.523    -.6305595    .3250087
----------------------------------------+----------------------------------------------------------------
 var(e.prop_emnes_excl_former_col_power)|   .1278765   .0386394                      .0695536    .2351049
---------------------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison
. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3b_replication.log
  log type:  text
 closed on:  12 Jun 2024, 15:03:05
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3b_replication.log
  log type:  text
 opened on:  12 Jun 2024, 15:03:05

. 
. summarize prop_emnes_excl_former_col_power c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_capita perc_road
> s_paved total_phones_per_1000 geographic_proximity 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
prop_emnes~r |         54    .1642776    .2601345          0          1
c1_voice_a~c |         64   -.6409375    .6038178      -1.75        .61
c2_pol_sta~y |         64   -.6548437    .8392154      -2.38       1.07
c3_gov_eff~s |         64   -.6017188    .5321641      -1.75        .25
c4_reg_qua~y |         64   -.4598437    .5850614      -2.35        .43
-------------+---------------------------------------------------------
c5_rule_of~w |         64   -.7315625    .3840851      -1.79       -.08
c6_control~n |         64   -.6585937    .3406337      -1.43        .17
gni_per_ca~a |         64    290.3125    136.2883        100        710
perc_roads~d |         64    16.21563    10.65616         .8       44.5
total_p~1000 |         64    26.65625    25.63803          3        104
-------------+---------------------------------------------------------
geographic~y |         64     .109375    .3145764          0          1

. 
. pwcorr prop_emnes_excl_former_col_power c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_capita perc_roads_p
> aved total_phones_per_1000 geographic_proximity, star(0.05)

             | prop_e~r c1_voi~c c2_pol~y c3_gov~s c4_reg~y c5_rul~w c6_con~n
-------------+---------------------------------------------------------------
prop_emnes~r |   1.0000 
c1_voice_a~c |   0.0527   1.0000 
c2_pol_sta~y |   0.0144   0.5744*  1.0000 
c3_gov_eff~s |   0.2843*  0.4154*  0.4908*  1.0000 
c4_reg_qua~y |   0.2847*  0.5897*  0.4863*  0.6565*  1.0000 
c5_rule_of~w |   0.1782   0.4604*  0.5572*  0.6684*  0.7682*  1.0000 
c6_control~n |  -0.0651   0.2762*  0.4504*  0.5725*  0.4315*  0.5580*  1.0000 
gni_per_ca~a |  -0.0428   0.0596  -0.0795   0.0290   0.0582   0.0039  -0.0011 
perc_roads~d |  -0.1630  -0.0985   0.2149   0.0605   0.0142   0.1043   0.1779 
total_p~1000 |   0.0673  -0.0090   0.2724*  0.3628*  0.1985   0.3922*  0.3316*
geographic~y |   0.4666*  0.1117   0.0664   0.2353   0.3000*  0.2156  -0.1140 

             | gni_pe~a perc_r~d tot~1000 geogra~y
-------------+------------------------------------
gni_per_ca~a |   1.0000 
perc_roads~d |   0.2465*  1.0000 
total_p~1000 |   0.3507*  0.4162*  1.0000 
geographic~y |  -0.1082  -0.2037   0.0776   1.0000 

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3b_replication.log
  log type:  text
 closed on:  12 Jun 2024, 15:03:05
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
