-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3a_replication.log
  log type:  text
 opened on:  12 Jun 2024, 15:55:01

. 
. xttobit prop_emnes_excl_former_col_power gni_per_capita perc_roads_paved total_phones_per_1000 geographic_proximity, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -47.104778  
Iteration 1:  Log likelihood = -35.551402  
Iteration 2:  Log likelihood = -34.914405  
Iteration 3:  Log likelihood =  -34.91409  
Iteration 4:  Log likelihood =  -34.91409  

Fitting full model:

Iteration 0:  Log likelihood = -40.407698  
Iteration 1:  Log likelihood = -29.182578  
Iteration 2:  Log likelihood =  -28.80485  
Iteration 3:  Log likelihood = -28.803793  
Iteration 4:  Log likelihood = -28.803793  

Obtaining starting values for full model:

Iteration 0:  Log likelihood =  20.948852
Iteration 1:  Log likelihood =  21.140814
Iteration 2:  Log likelihood =  21.141977
Iteration 3:  Log likelihood =  21.141978

Fitting full model:

Iteration 0:  Log likelihood = -19.885918  
Iteration 1:  Log likelihood = -13.261304  
Iteration 2:  Log likelihood =  -12.63495  
Iteration 3:  Log likelihood = -11.044207  (not concave)
Iteration 4:  Log likelihood = -10.955775  (not concave)
Iteration 5:  Log likelihood = -10.932843  (not concave)
Iteration 6:  Log likelihood = -10.923723  (not concave)
Iteration 7:  Log likelihood = -10.897363  (not concave)
Iteration 8:  Log likelihood = -10.877132  (not concave)
Iteration 9:  Log likelihood = -10.594262  (not concave)
Iteration 10: Log likelihood = -10.553897  (not concave)
Iteration 11: Log likelihood = -10.533288  (not concave)
Iteration 12: Log likelihood = -10.493577  (not concave)
Iteration 13: Log likelihood = -10.469997  (not concave)
Iteration 14: Log likelihood = -10.451883  (not concave)
Iteration 15: Log likelihood = -10.427199  (not concave)
Iteration 16: Log likelihood = -10.416937  (not concave)
Iteration 17: Log likelihood = -10.393375  (not concave)
Iteration 18: Log likelihood = -10.382705  (not concave)
Iteration 19: Log likelihood = -10.265108  (not concave)
Iteration 20: Log likelihood = -10.227311  (not concave)
Iteration 21: Log likelihood = -10.219976  (not concave)
Iteration 22: Log likelihood = -10.200582  (not concave)
Iteration 23: Log likelihood = -10.186437  (not concave)
Iteration 24: Log likelihood = -10.165932  (not concave)
Iteration 25: Log likelihood = -10.155593  (not concave)
Iteration 26: Log likelihood = -10.153324  (not concave)
Iteration 27: Log likelihood = -10.150365  (not concave)
Iteration 28: Log likelihood = -10.143282  (not concave)
Iteration 29: Log likelihood = -10.141979  (not concave)
Iteration 30: Log likelihood = -10.072817  (not concave)
Iteration 31: Log likelihood = -10.066262  (not concave)
Iteration 32: Log likelihood = -10.046981  (not concave)
Iteration 33: Log likelihood = -10.042821  (not concave)
Iteration 34: Log likelihood = -9.9973637  (not concave)
Iteration 35: Log likelihood = -9.9913025  (not concave)
Iteration 36: Log likelihood = -9.9904715  (not concave)
Iteration 37: Log likelihood = -9.9693524  (not concave)
Iteration 38: Log likelihood = -9.9605934  (not concave)
Iteration 39: Log likelihood =  -9.958152  (not concave)
Iteration 40: Log likelihood = -9.9575777  (not concave)
Iteration 41: Log likelihood = -9.9570668  (not concave)
Iteration 42: Log likelihood = -9.9472175  (not concave)
Iteration 43: Log likelihood = -9.9421689  (not concave)
Iteration 44: Log likelihood = -9.9346824  (not concave)
Iteration 45: Log likelihood = -9.9262299  (not concave)
Iteration 46: Log likelihood = -9.9164627  (not concave)
Iteration 47: Log likelihood = -9.9106869  (not concave)
Iteration 48: Log likelihood = -9.9104602  (not concave)
Iteration 49: Log likelihood = -9.9032812  (not concave)
Iteration 50: Log likelihood = -9.8989411  (not concave)
Iteration 51: Log likelihood = -9.8884067  (not concave)
Iteration 52: Log likelihood = -9.8827026  (not concave)
Iteration 53: Log likelihood = -9.8825634  (not concave)
Iteration 54: Log likelihood = -9.8805321  (not concave)
Iteration 55: Log likelihood = -9.8780714  (not concave)
Iteration 56: Log likelihood = -9.8777228  (not concave)
Iteration 57: Log likelihood = -9.8762811  (not concave)
Iteration 58: Log likelihood = -9.8749571  (not concave)
Iteration 59: Log likelihood = -9.8733979  (not concave)
Iteration 60: Log likelihood = -9.8718163  (not concave)
Iteration 61: Log likelihood = -9.8702402  (not concave)
Iteration 62: Log likelihood = -9.8681416  (not concave)
Iteration 63: Log likelihood = -9.8661109  (not concave)
Iteration 64: Log likelihood = -9.8642312  (not concave)
Iteration 65: Log likelihood = -9.8629553  (not concave)
Iteration 66: Log likelihood = -9.8629183  (not concave)
Iteration 67: Log likelihood = -9.8628539  (not concave)
Iteration 68: Log likelihood = -9.8478674  (not concave)
Iteration 69: Log likelihood = -9.8400887  (not concave)
Iteration 70: Log likelihood = -9.8388336  (not concave)
Iteration 71: Log likelihood = -9.8387522  (not concave)
Iteration 72: Log likelihood = -9.8379491  (not concave)
Iteration 73: Log likelihood =  -9.836459  (not concave)
Iteration 74: Log likelihood = -9.8355611  (not concave)
Iteration 75: Log likelihood = -9.8348462  (not concave)
Iteration 76: Log likelihood = -9.8340184  (not concave)
Iteration 77: Log likelihood = -9.8327032  (not concave)
Iteration 78: Log likelihood = -9.8313817  (not concave)
Iteration 79: Log likelihood = -9.8297016  (not concave)
Iteration 80: Log likelihood = -9.8274751  (not concave)
Iteration 81: Log likelihood = -9.8257777  (not concave)
Iteration 82: Log likelihood = -9.8231204  (not concave)
Iteration 83: Log likelihood = -9.8222742  (not concave)
Iteration 84: Log likelihood = -9.8039914  (not concave)
Iteration 85: Log likelihood = -9.7847454  (not concave)
Iteration 86: Log likelihood = -9.7846706  (not concave)
Iteration 87: Log likelihood = -9.7814756  (not concave)
Iteration 88: Log likelihood = -9.7811796  (not concave)
Iteration 89: Log likelihood = -9.7796017  (not concave)
Iteration 90: Log likelihood = -9.7772473  (not concave)
Iteration 91: Log likelihood =  -9.775634  (not concave)
Iteration 92: Log likelihood = -9.7740646  (not concave)
Iteration 93: Log likelihood = -9.7722928  (not concave)
Iteration 94: Log likelihood = -9.7720593  (not concave)
Iteration 95: Log likelihood = -9.7673132  (not concave)
Iteration 96: Log likelihood = -9.7631378  (not concave)
Iteration 97: Log likelihood = -9.7607489  (not concave)
Iteration 98: Log likelihood = -9.7593819  (not concave)
Iteration 99: Log likelihood = -9.7429683  (not concave)
Iteration 100: Log likelihood = -9.7189633  (not concave)
Iteration 101: Log likelihood =  -9.713957  (not concave)
Iteration 102: Log likelihood = -9.7131945  (not concave)
Iteration 103: Log likelihood = -9.7113493  (not concave)
Iteration 104: Log likelihood = -9.7097426  (not concave)
Iteration 105: Log likelihood =  -9.709097  (not concave)
Iteration 106: Log likelihood = -9.7080054  (not concave)
Iteration 107: Log likelihood = -9.7075218  (not concave)
Iteration 108: Log likelihood = -9.7062784  (not concave)
Iteration 109: Log likelihood = -9.7056336  (not concave)
Iteration 110: Log likelihood = -9.7045678  (not concave)
Iteration 111: Log likelihood = -9.7041118  (not concave)
Iteration 112: Log likelihood = -9.7029032  (not concave)
Iteration 113: Log likelihood = -9.7023275  (not concave)
Iteration 114: Log likelihood = -9.7013194  (not concave)
Iteration 115: Log likelihood = -9.7008373  (not concave)
Iteration 116: Log likelihood = -9.6996508  (not concave)
Iteration 117: Log likelihood = -9.6989707  (not concave)
Iteration 118: Log likelihood = -9.6977993  (not concave)
Iteration 119: Log likelihood = -9.6964314  (not concave)
Iteration 120: Log likelihood = -9.6953524  (not concave)
Iteration 121: Log likelihood = -9.6949079  (not concave)
Iteration 122: Log likelihood =  -9.593777  (not concave)
Iteration 123: Log likelihood =  -9.593628  (not concave)
Iteration 124: Log likelihood = -9.5739471  (not concave)
Iteration 125: Log likelihood = -9.5324462  (not concave)
Iteration 126: Log likelihood = -9.5300148  (not concave)
Iteration 127: Log likelihood = -9.4247732  (not concave)
Iteration 128: Log likelihood = -9.4223952  (not concave)
Iteration 129: Log likelihood = -9.4218902  (not concave)
Iteration 130: Log likelihood = -9.4161407  (not concave)
Iteration 131: Log likelihood = -9.4128954  (not concave)
Iteration 132: Log likelihood =  -9.412226  (not concave)
Iteration 133: Log likelihood = -9.4102661  (not concave)
Iteration 134: Log likelihood =  -9.410133  (not concave)
Iteration 135: Log likelihood = -9.4000193  (not concave)
Iteration 136: Log likelihood = -9.3960091  (not concave)
Iteration 137: Log likelihood = -9.3934661  (not concave)
Iteration 138: Log likelihood = -9.3921444  (not concave)
Iteration 139: Log likelihood =    -9.3908  (not concave)
Iteration 140: Log likelihood = -9.3889724  (not concave)
Iteration 141: Log likelihood = -9.3888216  (not concave)
Iteration 142: Log likelihood = -9.3855534  (not concave)
Iteration 143: Log likelihood = -9.3842582  (not concave)
Iteration 144: Log likelihood = -9.3833338  (not concave)
Iteration 145: Log likelihood = -9.3830783  (not concave)
Iteration 146: Log likelihood = -9.3830212  (not concave)
Iteration 147: Log likelihood = -9.3828562  (not concave)
Iteration 148: Log likelihood = -9.3822427  (not concave)
Iteration 149: Log likelihood = -9.3818377  (not concave)
Iteration 150: Log likelihood = -9.3817753  (not concave)
Iteration 151: Log likelihood = -9.3807873  (not concave)
Iteration 152: Log likelihood = -9.3796109  (not concave)
Iteration 153: Log likelihood = -9.3794612  (not concave)
Iteration 154: Log likelihood = -9.3794331  (not concave)
Iteration 155: Log likelihood = -9.3794036  (not concave)
Iteration 156: Log likelihood = -9.3787781  (not concave)
Iteration 157: Log likelihood = -9.3783759  (not concave)
Iteration 158: Log likelihood = -9.3783595  (not concave)
Iteration 159: Log likelihood = -9.3783442  (not concave)
Iteration 160: Log likelihood = -9.3723798  (not concave)
Iteration 161: Log likelihood = -9.3711309  (not concave)
Iteration 162: Log likelihood = -9.3710697  (not concave)
Iteration 163: Log likelihood = -9.3710661  (not concave)
Iteration 164: Log likelihood = -9.3706982  (not concave)
Iteration 165: Log likelihood = -9.3674787  (not concave)
Iteration 166: Log likelihood = -9.3596678  (not concave)
Iteration 167: Log likelihood = -9.3550522  
Iteration 168: Log likelihood = -9.3525173  
Iteration 169: Log likelihood = -9.3378585  
Iteration 170: Log likelihood = -9.3377074  
Iteration 171: Log likelihood = -9.3377071  

Random-effects tobit regression                     Number of obs     =     54
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     28
        Upper = 100                                    Right-censored =      0

Group variable: country_id                          Number of groups  =     28
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      1
                                                                  avg =    1.9
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(4)      =   8.89
Log likelihood = -9.3377071                         Prob > chi2       = 0.0638

--------------------------------------------------------------------------------------------------
prop_emnes_excl_former_col_power | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------------+----------------------------------------------------------------
                  gni_per_capita |   .0004619   .0006632     0.70   0.486    -.0008379    .0017617
                perc_roads_paved |   .0013197   .0107919     0.12   0.903     -.019832    .0224715
           total_phones_per_1000 |  -.0004472   .0036525    -0.12   0.903     -.007606    .0067115
            geographic_proximity |   .7218263   .2638184     2.74   0.006     .2047517    1.238901
                           _cons |  -.2947847   .2905105    -1.01   0.310    -.8641748    .2746054
---------------------------------+----------------------------------------------------------------
                        /sigma_u |   .3887154   .0740142     5.25   0.000     .2436502    .5337805
                        /sigma_e |   .0842113   .0173939     4.84   0.000     .0501198    .1183028
---------------------------------+----------------------------------------------------------------
                             rho |   .9551711   .0252697                      .8796188    .9868356
--------------------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 38.93              Prob >= chibar2 = 0.000


. 
. * Store the results of the random effects model
. estimates store re_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3a_replication.log
  log type:  text
 closed on:  12 Jun 2024, 15:55:02
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3a_replication.log
  log type:  text
 opened on:  12 Jun 2024, 15:55:02

. 
. tobit prop_emnes_excl_former_col_power gni_per_capita perc_roads_paved total_phones_per_1000 geographic_proximity, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -42.081818

Fitting full model:

Iteration 0:  Log likelihood = -42.081818  
Iteration 1:  Log likelihood = -31.211287  
Iteration 2:  Log likelihood = -28.822611  
Iteration 3:  Log likelihood =  -28.80392  
Iteration 4:  Log likelihood = -28.803793  
Iteration 5:  Log likelihood = -28.803793  

Tobit regression                                    Number of obs     =     54
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     28
        Upper = 100                                    Right-censored =      0

                                                    LR chi2(4)        =  12.22
                                                    Prob > chi2       = 0.0158
Log likelihood = -28.803793                         Pseudo R2         = 0.1750

---------------------------------------------------------------------------------------------------------
       prop_emnes_excl_former_col_power | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------------------------+----------------------------------------------------------------
                         gni_per_capita |   .0004266   .0004678     0.91   0.366     -.000513    .0013661
                       perc_roads_paved |  -.0014583   .0072199    -0.20   0.841    -.0159598    .0130433
                  total_phones_per_1000 |  -.0008004   .0030117    -0.27   0.792    -.0068496    .0052487
                   geographic_proximity |   .5877393   .1887144     3.11   0.003     .2086953    .9667832
                                  _cons |   -.177386   .2023093    -0.88   0.385    -.5837362    .2289642
----------------------------------------+----------------------------------------------------------------
 var(e.prop_emnes_excl_former_col_power)|   .1518264   .0463849                      .0821952    .2804451
---------------------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison
. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3a_replication.log
  log type:  text
 closed on:  12 Jun 2024, 15:55:02
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3a_replication.log
  log type:  text
 opened on:  12 Jun 2024, 15:55:02

. 
. summarize prop_emnes_excl_former_col_power gni_per_capita perc_roads_paved total_phones_per_1000 geographic_proximity 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
prop_emnes~r |         54    .1642776    .2601345          0          1
gni_per_ca~a |         64    290.3125    136.2883        100        710
perc_roads~d |         64    16.21563    10.65616         .8       44.5
total_p~1000 |         64    26.65625    25.63803          3        104
geographic~y |         64     .109375    .3145764          0          1

. 
. pwcorr prop_emnes_excl_former_col_power gni_per_capita perc_roads_paved total_phones_per_1000 geographic_proximity, star(0.05)

             | prop_e~r gni_pe~a perc_r~d tot~1000 geogra~y
-------------+---------------------------------------------
prop_emnes~r |   1.0000 
gni_per_ca~a |  -0.0428   1.0000 
perc_roads~d |  -0.1630   0.2465*  1.0000 
total_p~1000 |   0.0673   0.3507*  0.4162*  1.0000 
geographic~y |   0.4666* -0.1082  -0.2037   0.0776   1.0000 

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_3a_replication.log
  log type:  text
 closed on:  12 Jun 2024, 15:55:02
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
