-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_1b_replication.log
  log type:  text
 opened on:  14 Jun 2024, 15:59:25

. 
. xttobit prop_emnes c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_capita perc_roads_paved total_phones_per
> _1000 geographic_proximity colonial_link, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -42.719387  
Iteration 1:  Log likelihood = -24.405568  
Iteration 2:  Log likelihood = -22.758864  
Iteration 3:  Log likelihood = -22.742176  
Iteration 4:  Log likelihood = -22.742171  
Iteration 5:  Log likelihood = -22.742171  

Fitting full model:

Iteration 0:  Log likelihood = -16.773502  
Iteration 1:  Log likelihood =  2.4276754  
Iteration 2:  Log likelihood =   3.367841  
Iteration 3:  Log likelihood =  3.3694584  
Iteration 4:  Log likelihood =  3.3694584  

Obtaining starting values for full model:

Iteration 0:  Log likelihood =  89.073676
Iteration 1:  Log likelihood =  92.213818
Iteration 2:  Log likelihood =  96.637371
Iteration 3:  Log likelihood =  97.089786
Iteration 4:  Log likelihood =  97.109078
Iteration 5:  Log likelihood =  97.109152

Fitting full model:

Iteration 0:  Log likelihood = -.72411064  
Iteration 1:  Log likelihood =  16.633509  
Iteration 2:  Log likelihood =  20.265118  
Iteration 3:  Log likelihood =   20.52209  
Iteration 4:  Log likelihood =  20.524545  
Iteration 5:  Log likelihood =  20.524545  (backed up)
Iteration 6:  Log likelihood =  20.578398  
Iteration 7:  Log likelihood =  20.579461  
Iteration 8:  Log likelihood =  20.579461  

Random-effects tobit regression                     Number of obs     =     64
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     38
        Upper = 100                                    Right-censored =      0

Group variable: country_id                          Number of groups  =     32
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(11)     = 112.86
Log likelihood = 20.579461                          Prob > chi2       = 0.0000

------------------------------------------------------------------------------------------
              prop_emnes | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
        c1_voice_and_acc |  -.0524586   .0363162    -1.44   0.149     -.123637    .0187197
        c2_pol_stability |  -.0527735   .0254019    -2.08   0.038    -.1025603   -.0029867
    c3_gov_effectiveness |   .0209652   .0270342     0.78   0.438    -.0320208    .0739512
          c4_reg_quality |   .1101683    .037357     2.95   0.003     .0369499    .1833867
          c5_rule_of_law |   .0741018   .0568697     1.30   0.193    -.0373608    .1855644
c6_control_of_corruption |  -.0665584   .0451717    -1.47   0.141    -.1550932    .0219765
          gni_per_capita |   .0002941     .00021     1.40   0.161    -.0001174    .0007057
        perc_roads_paved |   .0047255   .0025792     1.83   0.067    -.0003296    .0097806
   total_phones_per_1000 |  -.0016208   .0010879    -1.49   0.136    -.0037531    .0005115
    geographic_proximity |   .4452804   .0613326     7.26   0.000     .3250708      .56549
           colonial_link |   .1345699   .0531132     2.53   0.011     .0304699    .2386698
                   _cons |  -.3152417   .0883719    -3.57   0.000    -.4884476   -.1420359
-------------------------+----------------------------------------------------------------
                /sigma_u |   .1456122   .0273184     5.33   0.000     .0920691    .1991554
                /sigma_e |   .0280246   .0055501     5.05   0.000     .0171467    .0389025
-------------------------+----------------------------------------------------------------
                     rho |    .964282   .0194092                      .9063334    .9888987
------------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 34.42              Prob >= chibar2 = 0.000


. 
. * Store the results of the random effects model
. estimates store re_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_1b_replication.log
  log type:  text
 closed on:  14 Jun 2024, 15:59:26
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_1b_replication.log
  log type:  text
 opened on:  14 Jun 2024, 15:59:26

. 
. tobit prop_emnes c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_capita perc_roads_paved total_phones_per_1
> 000 geographic_proximity colonial_link, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -20.826538

Fitting full model:

Iteration 0:  Log likelihood = -20.826538  
Iteration 1:  Log likelihood = -1.4364096  
Iteration 2:  Log likelihood =  3.2342008  
Iteration 3:  Log likelihood =  3.3683734  
Iteration 4:  Log likelihood =  3.3694576  
Iteration 5:  Log likelihood =  3.3694584  
Iteration 6:  Log likelihood =  3.3694584  

Tobit regression                                    Number of obs     =     64
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     38
        Upper = 100                                    Right-censored =      0

                                                    LR chi2(11)       =  52.22
                                                    Prob > chi2       = 0.0000
Log likelihood = 3.3694584                          Pseudo R2         = 1.1482

------------------------------------------------------------------------------------------
              prop_emnes | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
        c1_voice_and_acc |  -.0817328   .0459319    -1.78   0.081    -.1738606     .010395
        c2_pol_stability |  -.0492828   .0365163    -1.35   0.183    -.1225253    .0239596
    c3_gov_effectiveness |   .0343546   .0556439     0.62   0.540    -.0772529    .1459622
          c4_reg_quality |   .1196771   .0596775     2.01   0.050    -.0000209     .239375
          c5_rule_of_law |   .0577772   .0903702     0.64   0.525    -.1234825    .2390369
c6_control_of_corruption |  -.0098131    .081385    -0.12   0.904    -.1730507    .1534245
          gni_per_capita |   .0002733   .0001547     1.77   0.083     -.000037    .0005836
        perc_roads_paved |   .0026859   .0023083     1.16   0.250     -.001944    .0073158
   total_phones_per_1000 |  -.0017109   .0010582    -1.62   0.112    -.0038334    .0004116
    geographic_proximity |   .3232677   .0595281     5.43   0.000     .2038695    .4426659
           colonial_link |   .1264618   .0589514     2.15   0.037     .0082203    .2447033
                   _cons |   -.192614   .0781915    -2.46   0.017    -.3494463   -.0357817
-------------------------+----------------------------------------------------------------
        var(e.prop_emnes)|   .0131764   .0040338                      .0071305    .0243483
------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison
. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_1b_replication.log
  log type:  text
 closed on:  14 Jun 2024, 15:59:26
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_1b_replication.log
  log type:  text
 opened on:  14 Jun 2024, 15:59:26

. 
. summarize prop_emnes c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_capita perc_roads_paved total_phones_p
> er_1000 geographic_proximity colonial_link

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  prop_emnes |         64    .0725821    .1202001          0         .5
c1_voice_a~c |         64   -.6409375    .6038178      -1.75        .61
c2_pol_sta~y |         64   -.6548437    .8392154      -2.38       1.07
c3_gov_eff~s |         64   -.6017188    .5321641      -1.75        .25
c4_reg_qua~y |         64   -.4598437    .5850614      -2.35        .43
-------------+---------------------------------------------------------
c5_rule_of~w |         64   -.7315625    .3840851      -1.79       -.08
c6_control~n |         64   -.6585937    .3406337      -1.43        .17
gni_per_ca~a |         64    290.3125    136.2883        100        710
perc_roads~d |         64    16.21563    10.65616         .8       44.5
total_p~1000 |         64    26.65625    25.63803          3        104
-------------+---------------------------------------------------------
geographic~y |         64     .109375    .3145764          0          1
colonial_l~k |         64         .75    .4364358          0          1

. 
. pwcorr prop_emnes c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_capita perc_roads_paved total_phones_per_
> 1000 geographic_proximity colonial_link, star(0.05)

             | prop~nes c1_voi~c c2_pol~y c3_gov~s c4_reg~y c5_rul~w c6_con~n
-------------+---------------------------------------------------------------
  prop_emnes |   1.0000 
c1_voice_a~c |  -0.0171   1.0000 
c2_pol_sta~y |  -0.0698   0.5744*  1.0000 
c3_gov_eff~s |   0.2218   0.4154*  0.4908*  1.0000 
c4_reg_qua~y |   0.3401*  0.5897*  0.4863*  0.6565*  1.0000 
c5_rule_of~w |   0.1827   0.4604*  0.5572*  0.6684*  0.7682*  1.0000 
c6_control~n |  -0.1443   0.2762*  0.4504*  0.5725*  0.4315*  0.5580*  1.0000 
gni_per_ca~a |   0.0774   0.0596  -0.0795   0.0290   0.0582   0.0039  -0.0011 
perc_roads~d |  -0.1347  -0.0985   0.2149   0.0605   0.0142   0.1043   0.1779 
total_p~1000 |   0.0718  -0.0090   0.2724*  0.3628*  0.1985   0.3922*  0.3316*
geographic~y |   0.7650*  0.1117   0.0664   0.2353   0.3000*  0.2156  -0.1140 
colonial_l~k |   0.3084*  0.1924   0.0981   0.1833   0.2264   0.1378  -0.0627 

             | gni_pe~a perc_r~d tot~1000 geogra~y coloni~k
-------------+---------------------------------------------
gni_per_ca~a |   1.0000 
perc_roads~d |   0.2465*  1.0000 
total_p~1000 |   0.3507*  0.4162*  1.0000 
geographic~y |  -0.1082  -0.2037   0.0776   1.0000 
colonial_l~k |   0.2255  -0.2094   0.1908   0.2023   1.0000 

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_1b_replication.log
  log type:  text
 closed on:  14 Jun 2024, 15:59:26
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
