----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_2b_replication.log
  log type:  text
 opened on:  20 Dec 2024, 21:45:25

. 
. xttobit prop_emnes_excl_nat_res c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_capita perc_ro
> ads_paved total_phones_per_1000 geographic_proximity colonial_link, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -43.032381  
Iteration 1:  Log likelihood =  -24.75286  
Iteration 2:  Log likelihood = -23.163533  
Iteration 3:  Log likelihood = -23.149036  
Iteration 4:  Log likelihood = -23.149032  
Iteration 5:  Log likelihood = -23.149032  

Fitting full model:

Iteration 0:  Log likelihood = -17.165883  
Iteration 1:  Log likelihood =  2.2853471  
Iteration 2:  Log likelihood =  3.2437911  
Iteration 3:  Log likelihood =  3.2459474  
Iteration 4:  Log likelihood =  3.2459475  

Obtaining starting values for full model:

Iteration 0:  Log likelihood =  86.125336
Iteration 1:  Log likelihood =  91.978974
Iteration 2:  Log likelihood =  93.804754
Iteration 3:  Log likelihood =  93.872598
Iteration 4:  Log likelihood =  93.872964

Fitting full model:

Iteration 0:  Log likelihood = -2.2954005  
Iteration 1:  Log likelihood =  15.310613  
Iteration 2:  Log likelihood =  18.501813  
Iteration 3:  Log likelihood =  18.617275  
Iteration 4:  Log likelihood =   18.61749  
Iteration 5:  Log likelihood =   18.61749  (backed up)
Iteration 6:  Log likelihood =   18.65916  
Iteration 7:  Log likelihood =  18.659863  
Iteration 8:  Log likelihood =  18.659863  

Random-effects tobit regression                     Number of obs     =     64
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     38
        Upper = 100                                    Right-censored =      0

Group variable: country_id                          Number of groups  =     32
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(11)     =  98.10
Log likelihood = 18.659863                          Prob > chi2       = 0.0000

------------------------------------------------------------------------------------------
 prop_emnes_excl_nat_res | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
        c1_voice_and_acc |  -.0465681   .0407294    -1.14   0.253    -.1263962      .03326
        c2_pol_stability |  -.0519596   .0291204    -1.78   0.074    -.1090346    .0051153
    c3_gov_effectiveness |   .0082428   .0301203     0.27   0.784     -.050792    .0672775
          c4_reg_quality |   .1170849   .0427069     2.74   0.006     .0333809    .2007889
          c5_rule_of_law |   .0955616   .0636598     1.50   0.133    -.0292093    .2203326
c6_control_of_corruption |  -.0778365   .0519855    -1.50   0.134    -.1797262    .0240532
          gni_per_capita |   .0002283     .00022     1.04   0.299    -.0002029    .0006595
        perc_roads_paved |   .0050112   .0028708     1.75   0.081    -.0006155     .010638
   total_phones_per_1000 |  -.0015032   .0011956    -1.26   0.209    -.0038465    .0008401
    geographic_proximity |   .4358505   .0662659     6.58   0.000     .3059718    .5657292
           colonial_link |    .140459   .0617194     2.28   0.023     .0194912    .2614269
                   _cons |  -.2976676   .0976904    -3.05   0.002    -.4891372    -.106198
-------------------------+----------------------------------------------------------------
                /sigma_u |   .1457194   .0288744     5.05   0.000     .0891266    .2023122
                /sigma_e |   .0318693   .0064072     4.97   0.000     .0193114    .0444273
-------------------------+----------------------------------------------------------------
                     rho |   .9543522   .0258969                      .8768202    .9867215
------------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 30.83              Prob >= chibar2 = 0.000


. 
. * Store the results of the random effects model

. estimates store re_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_2b_replication.log
  log type:  text
 closed on:  20 Dec 2024, 21:45:25
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_2b_replication.log
  log type:  text
 opened on:  20 Dec 2024, 21:45:25

. 
. tobit prop_emnes_excl_nat_res c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_capita perc_road
> s_paved total_phones_per_1000 geographic_proximity colonial_link, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -21.119248

Fitting full model:

Iteration 0:  Log likelihood = -21.119248  
Iteration 1:  Log likelihood = -1.5715456  
Iteration 2:  Log likelihood =  3.0741269  
Iteration 3:  Log likelihood =  3.2446396  
Iteration 4:  Log likelihood =  3.2459464  
Iteration 5:  Log likelihood =  3.2459475  
Iteration 6:  Log likelihood =  3.2459475  

Tobit regression                                    Number of obs     =     64
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     38
        Upper = 100                                    Right-censored =      0

                                                    LR chi2(11)       =  52.79
                                                    Prob > chi2       = 0.0000
Log likelihood = 3.2459475                          Pseudo R2         = 1.1402

------------------------------------------------------------------------------------------------
       prop_emnes_excl_nat_res | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------------------+----------------------------------------------------------------
              c1_voice_and_acc |  -.0860278   .0468254    -1.84   0.072    -.1799477     .007892
              c2_pol_stability |  -.0546754   .0379067    -1.44   0.155    -.1307065    .0213557
          c3_gov_effectiveness |   .0384786   .0571691     0.67   0.504    -.0761881    .1531453
                c4_reg_quality |   .1463949   .0610871     2.40   0.020     .0238698      .26892
                c5_rule_of_law |   .0522851   .0924925     0.57   0.574    -.1332315    .2378016
      c6_control_of_corruption |  -.0027377   .0835036    -0.03   0.974    -.1702246    .1647492
                gni_per_capita |    .000204   .0001583     1.29   0.203    -.0001135    .0005215
              perc_roads_paved |   .0031241   .0023729     1.32   0.194    -.0016354    .0078836
         total_phones_per_1000 |  -.0016864   .0010792    -1.56   0.124    -.0038511    .0004783
          geographic_proximity |   .3152007   .0605136     5.21   0.000     .1938259    .4365755
                 colonial_link |   .1354962   .0605982     2.24   0.030     .0139516    .2570407
                         _cons |  -.1804934   .0795839    -2.27   0.027    -.3401186   -.0208682
-------------------------------+----------------------------------------------------------------
 var(e.prop_emnes_excl_nat_res)|   .0135914   .0041336                      .0073847    .0250146
------------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison

. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_2b_replication.log
  log type:  text
 closed on:  20 Dec 2024, 21:45:25
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_2b_replication.log
  log type:  text
 opened on:  20 Dec 2024, 21:45:25

. 
. summarize prop_emnes_excl_nat_res c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_capita perc_
> roads_paved total_phones_per_1000 geographic_proximity colonial_link

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
prop_emnes~s |         64    .0726409    .1232506          0         .5
c1_voice_a~c |         64   -.6409375    .6038178      -1.75        .61
c2_pol_sta~y |         64   -.6548437    .8392154      -2.38       1.07
c3_gov_eff~s |         64   -.6017188    .5321641      -1.75        .25
c4_reg_qua~y |         64   -.4598437    .5850614      -2.35        .43
-------------+---------------------------------------------------------
c5_rule_of~w |         64   -.7315625    .3840851      -1.79       -.08
c6_control~n |         64   -.6585937    .3406337      -1.43        .17
gni_per_ca~a |         64    290.3125    136.2883        100        710
perc_roads~d |         64    16.21563    10.65616         .8       44.5
total_p~1000 |         64    26.65625    25.63803          3        104
-------------+---------------------------------------------------------
geographic~y |         64     .109375    .3145764          0          1
colonial_l~k |         64         .75    .4364358          0          1

. 
. pwcorr prop_emnes_excl_nat_res c1_voice_and_acc c2_pol_stability c3_gov_effectiveness c4_reg_quality c5_rule_of_law c6_control_of_corruption gni_per_capita perc_roa
> ds_paved total_phones_per_1000 geographic_proximity colonial_link, star(0.05)

             | prop~res c1_voi~c c2_pol~y c3_gov~s c4_reg~y c5_rul~w c6_con~n
-------------+---------------------------------------------------------------
prop_emnes~s |   1.0000 
c1_voice_a~c |   0.0021   1.0000 
c2_pol_sta~y |  -0.0391   0.5744*  1.0000 
c3_gov_eff~s |   0.2627*  0.4154*  0.4908*  1.0000 
c4_reg_qua~y |   0.3847*  0.5897*  0.4863*  0.6565*  1.0000 
c5_rule_of~w |   0.2157   0.4604*  0.5572*  0.6684*  0.7682*  1.0000 
c6_control~n |  -0.1082   0.2762*  0.4504*  0.5725*  0.4315*  0.5580*  1.0000 
gni_per_ca~a |   0.0242   0.0596  -0.0795   0.0290   0.0582   0.0039  -0.0011 
perc_roads~d |  -0.1180  -0.0985   0.2149   0.0605   0.0142   0.1043   0.1779 
total_p~1000 |   0.0766  -0.0090   0.2724*  0.3628*  0.1985   0.3922*  0.3316*
geographic~y |   0.7543*  0.1117   0.0664   0.2353   0.3000*  0.2156  -0.1140 
colonial_l~k |   0.3010*  0.1924   0.0981   0.1833   0.2264   0.1378  -0.0627 

             | gni_pe~a perc_r~d tot~1000 geogra~y coloni~k
-------------+---------------------------------------------
gni_per_ca~a |   1.0000 
perc_roads~d |   0.2465*  1.0000 
total_p~1000 |   0.3507*  0.4162*  1.0000 
geographic~y |  -0.1082  -0.2037   0.0776   1.0000 
colonial_l~k |   0.2255  -0.2094   0.1908   0.2023   1.0000 

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../results/model_2b_replication.log
  log type:  text
 closed on:  20 Dec 2024, 21:45:25
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
