-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_1a_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:39:51

. 
. xttobit prop_emnes gni_per_capita perc_roads_paved total_phones_per_1000 geographic_proximity
>  colonial_link, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -162.45381  
Iteration 1:  Log likelihood = -144.13999  
Iteration 2:  Log likelihood = -142.49329  
Iteration 3:  Log likelihood =  -142.4766  
Iteration 4:  Log likelihood =  -142.4766  

Fitting full model:

Iteration 0:  Log likelihood =  -143.3382  
Iteration 1:  Log likelihood =  -123.8146  
Iteration 2:  Log likelihood = -122.82064  
Iteration 3:  Log likelihood = -122.81867  
Iteration 4:  Log likelihood = -122.81867  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -208.70115
Iteration 1:  Log likelihood = -206.95828
Iteration 2:  Log likelihood = -204.39105
Iteration 3:  Log likelihood = -204.12681
Iteration 4:  Log likelihood = -204.11715
Iteration 5:  Log likelihood = -204.11712

Fitting full model:

Iteration 0:  Log likelihood = -125.69471  
Iteration 1:  Log likelihood = -106.67503  
Iteration 2:  Log likelihood = -105.07027  
Iteration 3:  Log likelihood = -105.01304  
Iteration 4:  Log likelihood = -105.01304  (backed up)
Iteration 5:  Log likelihood = -104.88151  
Iteration 6:  Log likelihood = -104.87615  
Iteration 7:  Log likelihood = -104.87613  
Iteration 8:  Log likelihood = -104.87613  

Random-effects tobit regression                     Number of obs     =     64
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     38
        Upper = 100                                    Right-censored =      0

Group variable: country_id                          Number of groups  =     32
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(5)      =  71.81
Log likelihood = -104.87613                         Prob > chi2       = 0.0000

---------------------------------------------------------------------------------------
           prop_emnes | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
       gni_per_capita |   .0291179   .0229433     1.27   0.204    -.0158502    .0740861
     perc_roads_paved |   .6544696   .3006644     2.18   0.029     .0651782    1.243761
total_phones_per_1000 |  -.2158244   .1245867    -1.73   0.083    -.4600098     .028361
 geographic_proximity |   55.50508   7.045266     7.88   0.000     41.69662    69.31355
        colonial_link |   24.61954   7.171358     3.43   0.001     10.56394    38.67515
                _cons |  -46.68032   10.05435    -4.64   0.000    -66.38648   -26.97416
----------------------+----------------------------------------------------------------
             /sigma_u |   18.55902   3.595646     5.16   0.000     11.51168    25.60636
             /sigma_e |   3.401265   .6538332     5.20   0.000     2.119776    4.682755
----------------------+----------------------------------------------------------------
                  rho |   .9675044   .0174426                      .9154363    .9897106
---------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 35.89              Prob >= chibar2 = 0.000


. 
. * Store the results of the random effects model
. estimates store re_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_1a_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:39:52
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_1a_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:39:52

. 
. tobit prop_emnes gni_per_capita perc_roads_paved total_phones_per_1000 geographic_proximity c
> olonial_link, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -145.55677

Fitting full model:

Iteration 0:  Log likelihood = -145.55677  
Iteration 1:  Log likelihood = -127.72666  
Iteration 2:  Log likelihood = -122.91761  
Iteration 3:  Log likelihood =  -122.8197  
Iteration 4:  Log likelihood = -122.81867  
Iteration 5:  Log likelihood = -122.81867  

Tobit regression                                    Number of obs     =     64
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =     38
        Upper = 100                                    Right-censored =      0

                                                    LR chi2(5)        =  39.32
                                                    Prob > chi2       = 0.0000
Log likelihood = -122.81867                         Pseudo R2         = 0.1380

---------------------------------------------------------------------------------------
           prop_emnes | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
       gni_per_capita |   .0279504   .0167251     1.67   0.100    -.0055166    .0614173
     perc_roads_paved |   .3013212   .2545197     1.18   0.241    -.2079716     .810614
total_phones_per_1000 |   -.146055   .1036252    -1.41   0.164    -.3534086    .0612987
 geographic_proximity |   39.74115   6.539395     6.08   0.000     26.65585    52.82644
        colonial_link |   13.66749   6.546619     2.09   0.041     .5677353    26.76725
                _cons |  -25.38395   8.457803    -3.00   0.004    -42.30798   -8.459929
----------------------+----------------------------------------------------------------
     var(e.prop_emnes)|   189.4875     58.482                      102.1815    351.3895
---------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison
. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_1a_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:39:52
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_1a_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:39:52

. 
. summarize prop_emnes gni_per_capita perc_roads_paved total_phones_per_1000 geographic_proximi
> ty colonial_link

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  prop_emnes |         64    7.258214    12.02001          0         50
gni_per_ca~a |         64    290.3125    136.2883        100        710
perc_roads~d |         64    16.21563    10.65616         .8       44.5
total_p~1000 |         64    26.65625    25.63803          3        104
geographic~y |         64     .109375    .3145764          0          1
-------------+---------------------------------------------------------
colonial_l~k |         64         .75    .4364358          0          1

. 
. pwcorr prop_emnes gni_per_capita perc_roads_paved total_phones_per_1000 geographic_proximity 
> colonial_link, star(0.05)

             | prop~nes gni_pe~a perc_r~d tot~1000 geogra~y coloni~k
-------------+------------------------------------------------------
  prop_emnes |   1.0000 
gni_per_ca~a |   0.0774   1.0000 
perc_roads~d |  -0.1347   0.2465*  1.0000 
total_p~1000 |   0.0718   0.3507*  0.4162*  1.0000 
geographic~y |   0.7650* -0.1082  -0.2037   0.0776   1.0000 
colonial_l~k |   0.3084*  0.2255  -0.2094   0.1908   0.2023   1.0000 

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/complete_reproduction_folder/do_files/../res
> ults/model_1a_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:39:52
-----------------------------------------------------------------------------------------------
